#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает текущие остатки номенклатуры по складам из регистра накопления Товары//
// Параметры:
//   Номенклатура - СправочникСсылка.Номенклатура
//
// Возвращаемое значение:
//   Соответствие	- Остатки номенклатуры по складам
//

Функция ПолучитьОстатки(Номенклатура) Экспорт	// ПолучитьОстатки
	Запрос = Новый Запрос;
	Запрос.Текст = "	ВЫБРАТЬ
	|	Товары.Склад КАК Склад,
	|	Товары.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(, Номенклатура = &Номенклатура) КАК Товары";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Остатки = Новый	Соответствие;
	Пока Выборка.Следующий() Цикл
		Остатки.Вставить(Выборка.Склад, Выборка.Остаток);
	КонецЦикла;
	Возврат Остатки;
КонецФункции // ПолучитьОстатки

#КонецОбласти

#КонецЕсли
